poem = '''Любіть Україну, як сонце, любіть,
як вітер, і трави, і води…
В годину щасливу і в радості мить,
любіть у годину негоди.
Любіть Україну у сні й наяву,
вишневу свою Україну,
красу її, вічно живу і нову,
і мову її солов’їну.
Між братніх народів, мов садом рясним,
сіяє вона над віками…
Любіть Україну всім серцем своїм
і всіми своїми ділами.
Для нас вона в світі єдина, одна
в просторів солодкому чарі…
Вона у зірках, і у вербах вона,
і в кожному серця ударі,
у квітці, в пташині, в електровогнях,
у пісні у кожній, у думі,
в дитячий усмішці, в дівочих очах
і в стягів багряному шумі…'''

poem = (poem.lower().replace(',', '').replace('…', '')
        .replace('.', '').replace('\n', ' ').split())

print(poem)
words_dict = {i: poem.count(i) for i in poem}

most_popular = max(words_dict, key=words_dict.get)
least_popular = min(words_dict, key=words_dict.get)

print(f'Найбільше зустрічається слово "{most_popular}" - '
      f'{words_dict[most_popular]} разів. \nСеред найменш уживаних у вірші '
      f'слів - "{least_popular}" - {words_dict[least_popular]} раз')
